Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/atdf/PIC32CM5164JH01048.atdf
      <register-group name="CAN_RXF0E" caption="Rx FIFO 0 Element" aligned="4">
        <register name="CAN_RXF0E_0" caption="Rx FIFO 0 Element 0" offset="0x0" rw="RW" size="4" initval="0x00000000">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF0E_1" caption="Rx FIFO 0 Element 1" offset="0x4" rw="RW" size="4" initval="0x00000000">
          <bitfield name="RXTS" caption="Rx Timestamp" mask="0x0000FFFF"/>
          <bitfield name="DLC" caption="Data Length Code" mask="0x000F0000"/>
          <bitfield name="BRS" caption="Bit Rate Switch" mask="0x00100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x00200000"/>
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F000000"/>
          <bitfield name="ANMF" caption="Accepted Non-matching Frame" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF0E_DATA" caption="Rx FIFO 0 Element Data" offset="0x8" rw="RW" size="4" count="16" initval="0x00000000">
          <bitfield name="DB0" caption="Data Byte 0" mask="0x000000FF"/>
          <bitfield name="DB1" caption="Data Byte 1" mask="0x0000FF00"/>
          <bitfield name="DB2" caption="Data Byte 2" mask="0x00FF0000"/>
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_RXF1E" caption="Rx FIFO 1 Element" aligned="4">
        <register name="CAN_RXF1E_0" caption="Rx FIFO 1 Element 0" offset="0x0" rw="RW" size="4" initval="0x00000000">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF1E_1" caption="Rx FIFO 1 Element 1" offset="0x4" rw="RW" size="4" initval="0x00000000">
          <bitfield name="RXTS" caption="Rx Timestamp" mask="0x0000FFFF"/>
          <bitfield name="DLC" caption="Data Length Code" mask="0x000F0000"/>
          <bitfield name="BRS" caption="Bit Rate Switch" mask="0x00100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x00200000"/>
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F000000"/>
          <bitfield name="ANMF" caption="Accepted Non-matching Frame" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF1E_DATA" caption="Rx FIFO 1 Element Data" offset="0x8" rw="RW" size="4" count="16" initval="0x00000000">
          <bitfield name="DB0" caption="Data Byte 0" mask="0x000000FF"/>
          <bitfield name="DB1" caption="Data Byte 1" mask="0x0000FF00"/>
          <bitfield name="DB2" caption="Data Byte 2" mask="0x00FF0000"/>
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_TXBE" caption="Tx Buffer Element" aligned="4">
        <register name="CAN_TXBE_0" caption="Tx Buffer Element 0" offset="0x0" rw="RW" size="4" initval="0x00000000">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_TXBE_1" caption="Tx Buffer Element 1" offset="0x4" rw="RW" size="4" initval="0x00000000">
          <bitfield name="DLC" caption="Data Length Code" mask="0x000F0000"/>
          <bitfield name="BRS" caption="Bit Rate Switch" mask="0x00100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x00200000"/>
          <bitfield name="EFC" caption="Event FIFO Control" mask="0x00800000"/>
          <bitfield name="MM" caption="Message Marker" mask="0xFF000000"/>
        </register>
        <register name="CAN_TXBE_DATA" caption="Tx Buffer Element Data" offset="0x8" rw="RW" size="4" count="16" initval="0x00000000">
          <bitfield name="DB0" caption="Data Byte 0" mask="0x000000FF"/>
          <bitfield name="DB1" caption="Data Byte 1" mask="0x0000FF00"/>
          <bitfield name="DB2" caption="Data Byte 2" mask="0x00FF0000"/>
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_TXEFE" caption="Tx Event FIFO Element" aligned="4">
        <register name="CAN_TXEFE_0" caption="Tx Event FIFO Element 0" offset="0x0" rw="RW" size="4" initval="0x00000000">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_TXEFE_1" caption="Tx Event FIFO Element 1" offset="0x4" rw="RW" size="4" initval="0x00000000">
          <bitfield name="TXTS" caption="Tx Timestamp" mask="0x0000FFFF"/>
          <bitfield name="DLC" caption="Data Length Code" mask="0x000F0000"/>
          <bitfield name="BRS" caption="Bit Rate Switch" mask="0x00100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x00200000"/>
          <bitfield name="ET" caption="Event Type" mask="0x00C00000" values="CAN_TXEFE_1__ET"/>
          <bitfield name="MM" caption="Message Marker" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_SIDFE" caption="Standard Message ID Filter Element" aligned="4">
        <register name="CAN_SIDFE_0" caption="Standard Message ID Filter Element 0" offset="0x0" rw="RW" size="4" initval="0x00000000">
          <bitfield name="SFID2" caption="Standard Filter ID 2" mask="0x000007FF"/>
          <bitfield name="SFID1" caption="Standard Filter ID 1" mask="0x07FF0000"/>
          <bitfield name="SFEC" caption="Standard Filter Element Configuration" mask="0x38000000" values="CAN_SIDFE_0__SFEC"/>
          <bitfield name="SFT" caption="Standard Filter Type" mask="0xC0000000" values="CAN_SIDFE_0__SFT"/>
        </register>
      </register-group>
      <register-group name="CAN_XIDFE" caption="Extended Message ID Filter Element" aligned="4">
        <register name="CAN_XIDFE_0" caption="Extended Message ID Filter Element 0" offset="0x0" rw="RW" size="4" initval="0x00000000">
          <bitfield name="EFID1" caption="Extended Filter ID 1" mask="0x1FFFFFFF"/>
          <bitfield name="EFEC" caption="Extended Filter Element Configuration" mask="0xE0000000" values="CAN_XIDFE_0__EFEC"/>
        </register>
        <register name="CAN_XIDFE_1" caption="Extended Message ID Filter Element 1" offset="0x4" rw="RW" size="4" initval="0x00000000">
          <bitfield name="EFID2" caption="Extended Filter ID 2" mask="0x1FFFFFFF"/>
          <bitfield name="EFT" caption="Extended Filter Type" mask="0xC0000000" values="CAN_XIDFE_1__EFT"/>
        </register>
      </register-group>
      <value-group name="CAN_SIDFE_0__SFEC">
        <value name="DISABLE" caption="Disable filter element" value="0"/>
        <value name="STF0M" caption="Store in Rx FIFO 0 if filter match" value="1"/>
        <value name="STF1M" caption="Store in Rx FIFO 1 if filter match" value="2"/>
        <value name="REJECT" caption="Reject ID if filter match" value="3"/>
        <value name="PRIORITY" caption="Set priority if filter match" value="4"/>
        <value name="PRIF0M" caption="Set priority and store in FIFO 0 if filter match" value="5"/>
        <value name="PRIF1M" caption="Set priority and store in FIFO 1 if filter match" value="6"/>
        <value name="STRXBUF" caption="Store into Rx Buffer" value="7"/>
      </value-group>
      <value-group name="CAN_SIDFE_0__SFT">
        <value name="RANGE" caption="Range filter from SFID1 to SFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for SFID1 or SFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
      </value-group>
      <value-group name="CAN_XIDFE_0__EFEC">
        <value name="DISABLE" caption="Disable filter element" value="0"/>
        <value name="STF0M" caption="Store in Rx FIFO 0 if filter match" value="1"/>
        <value name="STF1M" caption="Store in Rx FIFO 1 if filter match" value="2"/>
        <value name="REJECT" caption="Reject ID if filter match" value="3"/>
        <value name="PRIORITY" caption="Set priority if filter match" value="4"/>
        <value name="PRIF0M" caption="Set priority and store in FIFO 0 if filter match" value="5"/>
        <value name="PRIF1M" caption="Set priority and store in FIFO 1 if filter match" value="6"/>
        <value name="STRXBUF" caption="Store into Rx Buffer" value="7"/>
      </value-group>
      <value-group name="CAN_TXEFE_1__ET">
        <value name="TXE" caption="Tx event" value="1"/>
        <value name="TXC" caption="Transmission in spite of cancellation" value="2"/>
      </value-group>
      <value-group name="CAN_XIDFE_1__EFT">
        <value name="RANGEM" caption="Range filter from EFID1 to EFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for EFID1 or EFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
        <value name="RANGE" caption="Range filter from EFID1 to EFID2 with no XIDAM mask" value="3"/>
      </value-group>
