Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/atdf/PIC32CM5164JH01048.atdf
      <value-group name="ICM_RCFG__RHIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__SUIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WCIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WRAP">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_UASR__URAT">
        <value name="UNSPEC_STRUCT_MEMBER" caption="Unspecified structure member set to one detected when the descriptor is loaded" value="0x0"/>
        <value name="CFG_MODIFIED" caption="CFG modified during active monitoring" value="0x1"/>
        <value name="DSCR_MODIFIED" caption="DSCR modified during active monitoring" value="0x2"/>
        <value name="HASH_MODIFIED" caption="HASH modified during active monitoring" value="0x3"/>
        <value name="READ_ACCESS" caption="Write-only register read access" value="0x4"/>
      </value-group>
    </module>
    <module name="SMBIST" id="03788" name2="test_mbistintf_v1" version="1a0" caption="SRAM MBIST Interface">
      <register-group name="SMBIST" caption="SRAM MBIST Interface">
        <register name="CTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SMBISTP1" caption="SRAM MBIST Partition 1 test start" mask="0x1"/>
          <bitfield name="SMBISTP2" caption="SRAM MBIST Partition 2 test start" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Status">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="FAIL" caption="Fail" mask="0x2"/>
        </register>
      </register-group>
    </module>
    <module name="MCLK" id="U2234" version="2.0.0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x00007FFF" caption="AHB Mask">
          <bitfield name="APBA_" caption="APBA AHB Clock Mask" mask="0x1"/>
          <bitfield name="APBB_" caption="APBB AHB Clock Mask" mask="0x2"/>
          <bitfield name="APBC_" caption="APBC AHB Clock Mask" mask="0x4"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x8"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS AHB Clock Mask" mask="0x10"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x20"/>
          <bitfield name="MCRAMC_" caption="MCRAMC AHB Clock Mask" mask="0x40"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x80"/>
          <bitfield name="CAN0_" caption="CAN0 AHB Clock Mask" mask="0x100"/>
          <bitfield name="CAN1_" caption="CAN1 AHB Clock Mask" mask="0x200"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x400"/>
          <bitfield name="DIVAS_" caption="DIVAS AHB Clock Mask" mask="0x1000"/>
          <bitfield name="APBD_" caption="APBD AHB Clock Mask" mask="0x2000"/>
          <bitfield name="ICM_" caption="ICM AHB Clock Mask" mask="0x4000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x00001FFF" caption="APBA Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
          <bitfield name="MCRAMC_" caption="MCRAMC APB Clock Enable" mask="0x1000"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000007" caption="APBB Mask">
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Clock Enable" mask="0x20"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x08000000" caption="APBC Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Clock Enable" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Clock Enable" mask="0x40"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x800"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3 APB Clock Enable" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0 APB Clock Enable" mask="0x20000"/>
          <bitfield name="ADC1_" caption="ADC1 APB Clock Enable" mask="0x40000"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x80000"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x100000"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x200000"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x400000"/>
          <bitfield name="ICM_" caption="ICM APB Clock Enable" mask="0x2000000"/>
          <bitfield name="PDEC_" caption="PDEC APB Clock Enable" mask="0x4000000"/>
          <bitfield name="SMBIST_" caption="SMBIST APB Clock Enable" mask="0x8000000"/>
        </register>
