Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/atdf/PIC32CM5164JH01048.atdf
      <value-group name="SERCOM_SPIM_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="SCK is low when idle" value="0x0"/>
        <value name="IDLE_HIGH" caption="SCK is high when idle" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DORD">
        <value name="MSB" caption="MSB is transmitted first" value="0x0"/>
        <value name="LSB" caption="LSB is transmitted first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DIPO">
        <value name="PAD0" caption="SERCOM PAD[0] is used as data input" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD[1] is used as data input" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD[2] is used as data input" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD[3] is used as data input" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DOPO">
        <value name="0x0" caption="PAD[0]=DO, PAD[1]=SCK, PAD[2]=SlaveSS" value="0x0"/>
        <value name="0x1" caption="PAD[2]=DO, PAD[3]=SCK, PAD[1]=SlaveSS" value="0x1"/>
        <value name="0x2" caption="PAD[3]=DO, PAD[1]=SCK, PAD[2]=SlaveSS" value="0x2"/>
        <value name="0x3" caption="PAD[0]=DO, PAD[3]=SCK, PAD[1]=SlaveSS" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__FORM">
        <value name="SPI_FRAME" caption="SPI Frame" value="0x0"/>
        <value name="SPI_FRAME_WITH_ADDR" caption="SPI Frame with Addr" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__IBON">
        <value name="0x0" caption="STATUS.BUFOVF is set when it occurs in the data stream" value="0x0"/>
        <value name="0x1" caption="STATUS.BUFOVF is set immediately upon buffer overflow" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8 bits" value="0x0"/>
        <value name="9_BIT" caption="9 bits" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__AMODE">
        <value name="MASK" caption="ADDRMASK is used as a mask to the AADR register" value="0x0"/>
        <value name="2ADDRS" caption="The slave responds to the two unique addresses in ADDR and ADDRMASK" value="0x1"/>
        <value name="RANGE" caption="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__MSSEN">
        <value name="DISABLE" caption="Hardware SS control is disabled" value="0x0"/>
        <value name="ENABLE" caption="Hardware SS control is enabled" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__SSDE">
        <value name="DISABLE" caption="SS low detector is disabled" value="0x0"/>
        <value name="ENABLE" caption="SS low detector is enabled" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CMODE">
        <value name="ASYNC" caption="Asynchronous communication." value="0x0"/>
        <value name="SYNC" caption="Synchronous communication." value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge" value="0x0"/>
        <value name="IDLE_HIGH" caption="TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__DORD">
        <value name="MSB" caption="MSB is transmitted first." value="0x0"/>
        <value name="LSB" caption="LSB is transmitted first." value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__FORM">
        <value name="USART_FRAME_NO_PARITY" caption="USART frame" value="0x0"/>
        <value name="USART_FRAME_WITH_PARITY" caption="USART frame with parity" value="0x1"/>
        <value name="USART_FRAME_LINBRKGEN" caption="LIN Master Break and Sync generation" value="0x2"/>
        <value name="USART_FRAME_AUTO_BAUD_NO_PARITY" caption="Auto-baud (LIN Slave) - break detection and auto-baud" value="0x4"/>
        <value name="USART_FRAME_AUTO_BAUD_WITH_PARITY" caption="Auto-baud - break detection and auto-baud with parity" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__RXPO">
        <value name="PAD0" caption="SERCOM PAD[0] is used for data reception" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD[1] is used for data reception" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD[2] is used for data reception" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD[3] is used for data reception" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPA">
        <value name="ADJ0" caption="16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5" value="0x0"/>
        <value name="ADJ1" caption="16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6" value="0x1"/>
        <value name="ADJ2" caption="16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7" value="0x2"/>
        <value name="ADJ3" caption="16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPR">
        <value name="16X_ARITHMETIC" caption="16x over-sampling using arithmetic baudrate generation" value="0x0"/>
        <value name="16X_FRACTIONAL" caption="16x over-sampling using fractional baudrate generation" value="0x1"/>
        <value name="8X_ARITHMETIC" caption="8x over-sampling using arithmetic baudrate generation" value="0x2"/>
        <value name="8X_FRACTIONAL" caption="8x over-sampling using fractional baudrate generation" value="0x3"/>
        <value name="3X_ARITHMETIC" caption="3x over-sampling using arithmetic baudrate generation" value="0x4"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__TXPO">
        <value name="PAD0" caption="PAD[0]=TxD, PAD[1]=XCK" value="0x0"/>
        <value name="PAD1" caption="PAD[2]=TxD, PAD[3]=XCK" value="0x1"/>
        <value name="PAD2" caption="PAD[0]=TxD, PAD[2]=RTS/TE, PAD[3]=CTS" value="0x2"/>
        <value name="PAD3" caption="PAD[0]=TxD, PAD[1]=XCK, PAD[2]=RTS/TE" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8 Bits" value="0x0"/>
        <value name="9_BIT" caption="9 Bits" value="0x1"/>
        <value name="5_BIT" caption="5 Bits" value="0x5"/>
        <value name="6_BIT" caption="6 Bits" value="0x6"/>
        <value name="7_BIT" caption="7 Bits" value="0x7"/>
      </value-group>
